; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   grey_door_1 red_door_1 - door
   green_box_1 - box
   empty - empty_0
   room_4 room_2 - room
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2) (seen_psi_3))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (or (locked grey_door_1) (= ?obj green_box_1)) (hold_1)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (locked grey_door_1) (hold_1)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (= ?door grey_door_1) (hold_0)) (when (and (= ?door grey_door_1) (not (locked grey_door_1))) (not (hold_1))) (when (locked grey_door_1) (hold_1)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)) (not (or (= ?room2 room_2) (and (agentinroom room_2) (not (= ?room1 room_2))))))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (locked grey_door_1) (hold_1)) (when (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4))) (not (locked red_door_1))) (seen_psi_3)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (and (at_ grey_door_1) (not (or (locked grey_door_1) (and (at_ green_box_1) (not (= ?obj green_box_1)))))) (not (hold_1))) (when (or (locked grey_door_1) (and (at_ green_box_1) (not (= ?obj green_box_1)))) (hold_1)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (at_ grey_door_1) (not (or (locked grey_door_1) (= ?obj green_box_1) (at_ green_box_1)))) (not (hold_1))) (when (or (locked grey_door_1) (= ?obj green_box_1) (at_ green_box_1)) (hold_1)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))) (seen_psi_3)))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (and (at_ grey_door_1) (not (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))) (at_ green_box_1)))) (not (hold_1))) (when (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))) (at_ green_box_1)) (hold_1)) (when (not (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))))) (hold_2)) (when (or (agentinroom room_4) (not (or (and (not (locked ?door)) (= ?door red_door_1)) (and (locked red_door_1) (not (and (locked ?door) (= ?door red_door_1))))))) (seen_psi_3)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_3 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 yellow_door_1 - door
   yellow_ball_2 yellow_ball_1 blue_ball_1 green_ball_1 green_ball_2 red_ball_1 - ball
   blue_box_1 - box
 )
 (:init (agentinroom room_1) (objectinroom yellow_ball_1 room_1) (objectinroom green_box_1 room_1) (objectinroom blue_ball_1 room_1) (objectinroom green_ball_1 room_2) (objectinroom blue_box_1 room_2) (objectinroom green_ball_2 room_3) (objectinroom red_ball_1 room_3) (objectinroom yellow_ball_2 room_3) (objectcolor yellow_ball_1 yellowtype) (objectcolor green_box_1 greentype) (objectcolor blue_ball_1 bluetype) (objectcolor green_ball_1 greentype) (objectcolor blue_box_1 bluetype) (objectcolor green_ball_2 greentype) (objectcolor red_ball_1 redtype) (objectcolor yellow_ball_2 yellowtype) (objectcolor grey_door_1 greytype) (objectcolor purple_door_1 purpletype) (objectcolor yellow_door_1 yellowtype) (objectcolor red_door_1 redtype) (emptyhands) (locked grey_door_1) (locked purple_door_1) (locked yellow_door_1) (locked red_door_1) (adjacentrooms room_2 room_1 grey_door_1) (adjacentrooms room_1 room_2 grey_door_1) (adjacentrooms room_3 room_1 purple_door_1) (adjacentrooms room_1 room_3 purple_door_1) (adjacentrooms room_4 room_2 yellow_door_1) (adjacentrooms room_2 room_4 yellow_door_1) (adjacentrooms room_4 room_3 red_door_1) (adjacentrooms room_3 room_4 red_door_1) (visited room_1) (hold_1) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d yellowtype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor purple_door_1 room_1 room_3)
   added: (at_ purple_door_1)
   goals met: 1 of 4
2. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 1 of 4
3. (gotoroom room_1 room_3 purple_door_1)
   deleted: (agentinroom room_1) (at_ purple_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 4
4. (gotodoor red_door_1 room_3 room_4)
   added: (at_ red_door_1)
   goals met: 1 of 4
5. (toggle red_door_1)
   deleted: (locked red_door_1)
   added: (seen_psi_3)
   goals met: 1 of 4
6. (gotoroom room_3 room_1 purple_door_1)
   deleted: (agentinroom room_3) (at_ red_door_1)
   added: (agentinroom room_1)
   goals met: 1 of 4
7. (gotodoor grey_door_1 room_1 room_2)
   added: (at_ grey_door_1) (hold_0)
   goals met: 2 of 4
8. (toggle grey_door_1)
   deleted: (locked grey_door_1) (hold_1)
   added: (hold_2)
   goals met: 2 of 4
9. (gotoobject green_box_1 room_1)
   deleted: (at_ grey_door_1)
   added: (at_ green_box_1) (hold_1)
   goals met: 3 of 4
10. (gotoroom room_1 room_3 purple_door_1)
   deleted: (agentinroom room_1) (at_ green_box_1)
   added: (agentinroom room_3)
   goals met: 3 of 4
11. (gotoroom room_3 room_4 red_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_4) (visited room_4)
   goals met: 3 of 4
12. (gotodoor yellow_door_1 room_4 room_2)
   added: (at_ yellow_door_1)
   goals met: 3 of 4
13. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   goals met: 4 of 4
